/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：Add_practice03.c
	機能			：変数データの取り扱い
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数定義 */
	char moji;		/* ユーザ入力変数 */
	
	/* ユーザ入力 */
	printf("1文字入力してください：");
	scanf("%c", &moji);
	
	/* 表示 */
	printf("mojiの値　　　　：%x\n", moji);
	printf("mojiの文字データ：%c\n", moji);
	
	/* 結果return */
	return 0;
	
}
