/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：Add_practice01.c
	機能			：日付表示
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 日付表示 */
	printf("今日は%d年%d月%d日です。\n", 2011, 4 , 19);
	
	/* 結果return */
	return 0;
	
}
