/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：Add_practice10.c
	機能			：if -else-
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	int in;			/* ユーザ入力データ */
	int i;			/* ループ用変数 	*/
	int tCount;		/* Trueカウント 	*/
	
	/* 変数初期化 */
	tCount = 0;
	
	/* ユーザ入力と正否判定、正否回数カウント */
	for (i = 0; i < 20; i++) {
		printf("%d 100以上の整数を入力してください >", i);
		scanf("%d", &in);
		
		if (in >= 100) {
			printf("true\n");
			tCount++;
		} else {
			printf("false\n");
		}
	}
	
	
	/* 結果出力 */
	printf("true\t%d回,\t%d%%\n", tCount, (tCount * 100) / 20);
	printf("false\t%d回,\t%d%%\n", 20-tCount, ((20-tCount) * 100) / 20);
	
	return 0;
	
}
