/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice18.c
	機能			：標準ライブラリ関数
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	char in[64];	/* ユーザ入力データ */
	int len;		/* 文字列長 */
	int i;
	/* ユーザ入力 */
	printf("文字列を入力してください >");
	scanf("%s", &in);
	//////　改良
	for (i=0;i<64;i++){
//		printf("[%c(%x)],",in[i],in[i]);//デバッグ表示
		if(in[i]==0){//改行判定
//			printf("入力した文字列の長さ：%d\n", i);
			break;
		}
//		if(0==(i%5)){
//			printf("\n");//デバッグ表示
//		}
	}
//	printf("\n");//デバッグ表示
	//////　改良
	/* ユーザ入力表示と文字列長取得 */
	printf("入力した文字列：");
	len = printf("%s", in);
	printf("\n");
	
	/* 文字列長表示 */
	printf("入力した文字列の長さ：%d\n", len);
	
	/* 結果return */
	return 0;
	
}
