/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice03.c
	機能			：変数データの取り扱い
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数定義 */
	char moji;		/* 文字データ格納用変数 */
	
	/* 文字データ代入 */
	moji = 'G';
	
	/* 表示 */
	printf("mojiの値は%dです。\n", moji);
	printf("mojiの文字データは%cです。\n", moji);
	
	/* 結果return */
	return 0;
	
}
