/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice20.c
	機能			：ポインタアドレス表示関数
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	int iData=12;		/* intデータ 			*/
	int *p		;		/* intポインター変数	*/
	/* ユーザ入力 */
	printf("------------------------------\n");
	printf("iDataのアドレス=0x%p\n",&iData);
	printf("iDataの値=0x%x\n",iData);
	printf("------------------------------\n");
	printf("pにiDataのアドレスを代入\n");
	p = &iData;//intデータのポインタをpに代入
	printf("pのポインタ先の値は=0x%x\n",*p);
	printf("------------------------------\n");
	
	/* 結果return */
	return 0;
	
}
