/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice22.c
	機能			：ポインタ
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	char *str = "Hello World!";		/* 文字列 */
	int in;							/* ユーザ入力 */
	
	/* 文字列出力 */
	printf("%s", str);
	printf("\n");
	
	/* ユーザ入力 */
	printf("要素の番号を指定してください(0-11) >");
	scanf("%d", &in);
	
	/* ポインタ変数への代入 */
	str = str + in;
	
	/* 結果出力 */
	printf("指定した文字：%c\n", *str);
	printf("ASCIIコード：%d\n", *str);
	
	/* 結果return */
	return 0;
	
}
