/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice17.c
	機能			：二乗を関数を呼び出すメイン関数
	修正履歴		：1.00	2011/3/7	粟倉　康雄	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/* プロトタイプ宣言 */
int square(int num);

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2011/3/7	粟倉　康雄	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	int inputdata;	/* 入力データ */
//	int outputdata;	/* 出力データ */
	
	/* ユーザ入力 */
	printf("数値を入力してください(-10000～10000) >");
	scanf("%d", &inputdata);
//	outputdata = square(inputdata);
	/* 結果出力 */
	printf("２乗した値：%d\n", square(inputdata));
	
	/* 結果return */
	return 0;
	
}
/*======================================================================
	関数名			：square
	機能			：二乗演算処理
	入力引数説明	：二乗する数字
	出力引数説明	：None
	戻り値			：二乗した結果値
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2011/3/7	粟倉　康雄	作成
======================================================================*/

int square(int num)
{
	/* 結果return */
//	printf("square num = %d\n",num);
	return num * num;
	
}
