/*======================================================================
	プロジェクト名	：C言語プログラミング
	ファイル名		：practice24.c
	機能			：キャスト演算子(Sample15)
	修正履歴		：1.00	2010/3/14	粟倉　康雄	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/* 定義 */
#define DEF_A
#define DEF_B
#define BOOL 0

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/18	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数定義 */
	long a = 0xABCD;//long変数a

//	printf("そのまま表示  :0x%x\n",a);//aをそのままヘキサで表示
	printf("char  :%2d\n",(char)a);//aをchar型でキャスト変換してデシマルで表示
	printf("short :%4d\n",(short)a);//aをshort型でキャスト変換してデシマルで表示
//	printf("char  :0x%2x\n",(char)a);//aをchar型でキャスト変換してヘキサで表示
//	printf("short :0x%4x\n",(short)a);//aをshort型でキャスト変換してヘキサで表示
	
	/* 結果return */
	return 0;
}
