/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：Add_practice14.c
	機能			：自由解釈問題
	修正履歴		：1.00	2010/3/14	粟倉　康雄	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/* 定数定義 */
#define NUM_ARR	300 //数列要素の上限値

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/3/14	粟倉　康雄	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	long idata1=1;	/* ユーザデータ1 	*/
	long idata2=1;	/* ユーザデータ2 	*/
	long Addition=0;/* 加算結果			*/
	long Answer=0;	/* 合計答え			*/
	
	/* 演算ループ */
	printf("%d,%d",idata1,idata2) ;	//最初の２つの数字を画面表示
	Answer = idata1 +idata2 ;		//最初の２つの数字を合算して合計答えに代入
	while (1) {/* ループ	*/
		Addition = idata1+idata2;//1つ目と２つ目の数値を加算して加算結果に代入
		/* 終了判定 */
		if(NUM_ARR < Addition){//加算結果=数列要素の上限+1か？
			printf("\n");//改行入力
			/* 結果表示 */
			printf("合計：%d\n",Answer);
			/* 結果return */
			return 0;
		}
		printf(",%d",Addition);
		Answer = Answer + Addition;	//加算結果を求める。
		idata1 = idata2 ;			//値シフト
		idata2 = Addition;			//値シフト
	}
}
