/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：Add_practice05.c
	機能			：配列の使い方
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数定義 */
	int arr[3];		/* ユーザ入力データ */
	int sum;		/* 合計 */
	
	/*  ユーザ入力 */
	printf("int型の数値を3つ入力してください。\n");
	scanf("%d", &arr[0]);
	scanf("%d", &arr[1]);
	scanf("%d", &arr[2]);
	
	/* 入力結果表示 */
	printf("入力した値は配列に格納されました！\n");
	printf("あなたの入力した整数は %d,%d,%d です。\n", arr[0], arr[1],arr[2]);
	
	/* 入力合計を算出 */
	sum = arr[0] + arr[1] + arr[2];
	
	/* 計算結果出力 */
	printf("あなたの入力した整数の合計は%dです。\n", sum);
	
	/* 結果return */
	return 0;
	
}
