/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：Add_practice04.c
	機能			：変数データの取り扱い
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>
#include <string.h>

/* 定数定義 */
#define LEN_STR	256	/* 文字列長 */

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/02/04	研修 太郎	作成
					：1.01	2010/02/15	研修 太郎	リファクタリング
======================================================================*/

int main(void)
{
	/* 変数定義 */
	char str[LEN_STR] = {0};	/* ユーザ入力データ */
	int i;					/* ループ用変数 */
	
	/* ユーザ入力 */
	printf("文字列を入力してください：");
	scanf("%s", str);
	
	/* 結果表示 */
	i = 0;
	while(str[i]!='\0') {
		printf("入力(%d)の値　　　　：%x\n", i, str[i]);
		printf("入力(%d)の文字データ：%c\n", i, str[i]);
		i++;
	}
	
	/* 結果return */
	return 0;
	
}
