/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practicee07.c
	機能			：演算子の確認
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数定義 */
	int i1, i2;		/* int型ユーザ入力 */
	double d1, d2;	/* double型ユーザ入力 */
	
	/* ユーザ入力（整数） */
	printf("整数1を入力してください >");
	scanf("%d", &i1);
	printf("整数2を入力してください >");
	scanf("%d", &i2);
	
	/* 演算結果表示（整数） */
	printf("%d+%d⇒%d\n", i1,i2,i1 + i2);
	printf("%d-%d⇒%d\n", i1,i2,i1 - i2);
	printf("%d*%d⇒%d\n", i1,i2,i1 * i2);
	printf("%d/%d⇒%d\n", i1,i2,i1 / i2);
	printf("%d%%%d⇒%d\n", i1,i2,i1 % i2);

	
	/* ユーザ入力（実数） */
	printf("実数1を入力してください >");
	scanf("%lf", &d1);
	printf("実数2を入力してください >");
	scanf("%lf", &d2);
	
	/* 演算結果表示（実数） */
	printf("%g+%g⇒%g\n",d1 ,d2, d1 + d2);
	printf("%g-%g⇒%g\n", d1 ,d2,d1 - d2);
	printf("%g*%g⇒%g\n", d1 ,d2,d1 * d2);
	printf("%g/%g⇒%g\n",d1 ,d2, d1 / d2);
	
	/* 結果return */
	return 0;
	
}
