/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice03.c
	機能			：標準入出力関数の確認
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数定義 */
	int in[3];		/* ユーザ入力データ */
	char a;
	
	/* ユーザ入力 */
	scanf("%d %d %d %c", &in[0], &in[1], &in[2],&a);
	
	/* 表示 */
	printf("入力された数値は%d %d %d %cです。\n", in[0], in[1], in[2],a);
	
	/* 結果return */
	return 0;
	
}
