/*======================================================================
	プロジェクト名	：C言語基礎
	ファイル名		：practice15.c
	機能			：for
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
	Copyright(c) 2010 eSOL emBex inc. All Rights Reserved.
======================================================================*/

/* ヘッダファイル読み込み */
#include <stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：None
	出力引数説明	：None
	戻り値			：終了情報（常に０）
	入力情報		：None
	出力情報		：None
	特記事項		：None
	修正履歴		：1.00	2010/2/4	研修 太郎	作成
======================================================================*/

int main(void)
{
	/* 変数宣言 */
	int in[5];		/* ユーザ入力データ */
	int i;			/* ループ用変数 */
	
	/* ユーザ入力 */
	for (i = 0; i < 5; i++) {
		printf("第 %d の要素 >",i);
		scanf("%d", &in[i]);
	}
	
	/* 表示 */
	printf("入力された値は ");
	for (i = 0; i < 5; i++) {
		if(i == 4) {
			printf("%d", in[i]);
		}
		else {
			printf("%d,", in[i]);
		}
	}
	printf(" です。\n");
	
	/* 結果return */
	return 0;
	
}
